tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "microsoft/git"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# GNU typing tutor
brew "gnu-typist"
# Generic library support script
brew "libtool"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ["with-modern-bokehlicia-captiva-icon"]
# GPU-accelerated terminal emulator
cask "alacritty"
cask "font-iosevka-nerd-font"
# Sans-serif, slab-serif, monospace and quasi‑proportional typeface family
cask "font-iosevka-ss04"
# Keyboard customizer
cask "karabiner-elements"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
